In [1]:
import pandas as pd
import numpy as np

In [5]:
df=pd.read_csv('sales_data.csv')

In [3]:
#you can read in this way too -> r will help to read the file inspite of spaces present

#df=pd.read_csv(r'C:\Users\USER\dsprojects\AAPS Dataset Sales\sales_data.csv')

### Data Exploration

In [6]:
df

,order_id,company_id,company_name,date,order_value,sale_converted,sales_rep,sales_rep_id
0,SZZW8HGSD5QQX3JI,Z4L1WVR5TDCXRLM5,Later Pi,17-07-2016,5154,0,Alvin Jenson,EC6ZO52HL81ANX7W
1,9UX75FRFD5YCEXHK,Z4L1WVR5TDCXRLM5,Later Pi,24-04-2016,2948,0,Alvin Jenson,EC6ZO52HL81ANX7W
2,7ISQG9K1MTTVCP09,Z4L1WVR5TDCXRLM5,Later Pi,28-08-2018,2667,0,Alvin Jenson,EC6ZO52HL81ANX7W
3,PEXDGXSRBDXX5FIM,Z4L1WVR5TDCXRLM5,Later Pi,29-05-2016,564,0,Alvin Jenson,EC6ZO52HL81ANX7W
4,DOR9GU38YZCS88NN,Z4L1WVR5TDCXRLM5,Later Pi,03-06-2015,6449,0,Alvin Jenson,EC6ZO52HL81ANX7W
...,...,...,...,...,...,...,...,...
20124,4WQ8KNNAH8C4B3W0,JOIIYHRADS5LRWOL,Finer Reward,02-10-2017,9723,0,Victor Groves,LD5RZVLVVC605H23
20125,V1AGRCAYGEG709MT,JOIIYHRADS5LRWOL,Finer Reward,11-03-2016,8120,0,Victor Groves,LD5RZVLVVC605H23
20126,OPFUXYEB52A7I89R,JOIIYHRADS5LRWOL,Finer Reward,18-02-2016,4696,0,Victor Groves,LD5RZVLVVC605H23
20127,X3C2E16M3153ATF1,JOIIYHRADS5LRWOL,Finer Reward,24-07-2018,6350,0,Victor Groves,LD5RZVLVVC605H23
20128,Y8WD8L3CT7L7TT0Q,JOIIYHRADS5LRWOL,Finer Reward,05-04-2016,1693,0,Victor Groves,LD5RZVLVVC605H23

In [7]:
#no of rows
len(df)

20129

In [10]:
#no bracket here as this function does not need any parameters to pass
df.shape

(20129, 8)

In [11]:
df.head(10)

,order_id,company_id,company_name,date,order_value,sale_converted,sales_rep,sales_rep_id
0,SZZW8HGSD5QQX3JI,Z4L1WVR5TDCXRLM5,Later Pi,17-07-2016,5154,0,Alvin Jenson,EC6ZO52HL81ANX7W
1,9UX75FRFD5YCEXHK,Z4L1WVR5TDCXRLM5,Later Pi,24-04-2016,2948,0,Alvin Jenson,EC6ZO52HL81ANX7W
2,7ISQG9K1MTTVCP09,Z4L1WVR5TDCXRLM5,Later Pi,28-08-2018,2667,0,Alvin Jenson,EC6ZO52HL81ANX7W
3,PEXDGXSRBDXX5FIM,Z4L1WVR5TDCXRLM5,Later Pi,29-05-2016,564,0,Alvin Jenson,EC6ZO52HL81ANX7W
4,DOR9GU38YZCS88NN,Z4L1WVR5TDCXRLM5,Later Pi,03-06-2015,6449,0,Alvin Jenson,EC6ZO52HL81ANX7W
5,XZOTSRFIRMS0IEMP,Z4L1WVR5TDCXRLM5,Later Pi,19-01-2014,2041,0,Alvin Jenson,EC6ZO52HL81ANX7W
6,SLZFK0E4OHMODQ5L,Z4L1WVR5TDCXRLM5,Later Pi,30-01-2015,5010,0,Alvin Jenson,EC6ZO52HL81ANX7W
7,1C63R2TGP68AR7NP,Z4L1WVR5TDCXRLM5,Later Pi,07-11-2014,5797,0,Alvin Jenson,EC6ZO52HL81ANX7W
8,GLWLP2VJQ5R7DLZ9,Z4L1WVR5TDCXRLM5,Later Pi,15-10-2014,2209,0,Alvin Jenson,EC6ZO52HL81ANX7W
9,HS5RU6AMLAY58S73,Z4L1WVR5TDCXRLM5,Later Pi,02-08-2015,8326,1,Alvin Jenson,EC6ZO52HL81ANX7W

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20129 entries, 0 to 20128
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   order_id        20129 non-null  object
 1   company_id      20129 non-null  object
 2   company_name    20129 non-null  object
 3   date            20129 non-null  object
 4   order_value     20129 non-null  int64
 5   sale_converted  20129 non-null  int64
 6   sales_rep       20129 non-null  object
 7   sales_rep_id    20129 non-null  object
dtypes: int64(2), object(6)
memory usage: 1.2+ MB

In [14]:
#formatting date column
df['date']=pd.to_datetime(df['date'])

In [16]:
df['date']

0       2016-07-17
1       2016-04-24
2       2018-08-28
3       2016-05-29
4       2015-03-06
           ...
20124   2017-02-10
20125   2016-11-03
20126   2016-02-18
20127   2018-07-24
20128   2016-05-04
Name: date, Length: 20129, dtype: datetime64[ns]

In [17]:
df.dtypes

order_id                  object
company_id                object
company_name              object
date              datetime64[ns]
order_value                int64
sale_converted             int64
sales_rep                 object
sales_rep_id              object
dtype: object

In [18]:
#basic stats
#describing int types
df.describe()

        order_value  sale_converted
count  20129.000000    20129.000000
mean    5088.215808        0.167768
std     2862.299846        0.373669
min      101.000000        0.000000
25%     2607.000000        0.000000
50%     5135.000000        0.000000
75%     7580.000000        0.000000
max     9999.000000        1.000000

In [19]:
#describing object/string types
#top has the values with highest frequency
df.describe(include=object)

,order_id,company_id,company_name,sales_rep,sales_rep_id
count,20129,20129,20129,20129,20129
unique,20129,927,927,99,99
top,T02GXJQ1U9BS02Q6,7JMEKJZCPVDV5JTP,Smashed-Out Intercept,Alyssa Mckinney,VZ3PI0EC8K8M7NPY
freq,1,39,39,428,428

In [20]:
df['date'].describe()

count                   20129
unique                   1826
top       2016-01-07 00:00:00
freq                       23
first     2014-01-01 00:00:00
last      2018-12-31 00:00:00
Name: date, dtype: object

In [21]:
#num of distinct values in that column
df['sales_rep'].value_counts()

Alyssa Mckinney    428
Christina Clark    408
Tiffany Haley      404
Johanna Brauner    393
David Shirk        390
                  ...
Jason Rogers        26
Mary Brooks         23
Pat Schwartz        22
Joyce Wolf          20
Linda Thomas        19
Name: sales_rep, Length: 99, dtype: int64

In [22]:
df['sales_rep'].unique()

array(['Alvin Jenson', 'Linda Grandy', 'Jessica Oakley', 'Terry Thurman',
       'Barbara Tallent', 'Patricia Lebowitz', 'Debra Russell',
       'John Gilley', 'Theodora Thigpen', 'Myrna Whalen', 'Mary Fawbush',
       'Joyce Wolf', 'Kattie Williams', 'Cameron Calhoun',
       'Enrique Burns', 'Elijah Valenti', 'Marla Sohn', 'Barry Mcaleer',
       'James Brooks', 'John Augustine', 'Margaret Groce', 'Melvin Fagan',
       'Kristin Dawes', 'James Carter', 'Sean Juarez', 'Sherita Lum',
       'Jason Rogers', 'Joanna Nelson', 'John Shaw', 'Rosendo Barnes',
       'Andrea Kanish', 'Mark Jackson', 'Joel Parker',
       'Kathleen Gonzalez', 'Crystal Malik', 'Amy Jernigan',
       'Helen Kilkenny', 'Robert Furr', 'Maria Moradian', 'David Burton',
       'Alejandro Ford', 'Josefina Karalis', 'Dora Highsmith',
       'Charles Williams', 'William Reynolds', 'Mary Davis',
       'Christina Clark', 'Victoria Duncan', 'Cherie Purnell',
       'Laura Rybij', 'Michael Leeper', 'Nancy Shorter', 'Brooke Kent',
       'Cindy Landes', 'Jose Shelton', 'Angel Guidry', 'Sandra Reveles',
       'Sarah Cabral', 'James Eckert', 'Sandra Washington', 'Jack Kelley',
       'Daniel Routzahn', 'Teresita Black', 'Edward Long', 'Mary Harris',
       'Monica March', 'David Shirk', 'Ray Oneill', 'Tiffany Haley',
       'Rocco Wood', 'John Piazza', 'Linda Rodriquez', 'Robert Hallman',
       'Kara Monteagudo', 'Stephen Thomas', 'Janice Ward', 'David Nicola',
       'Essie Smith', 'Johanna Brauner', 'Joshua Yarbrough',
       'Richard Brooks', 'Linda Thomas', 'Pat Schwartz', 'Shawna Strang',
       'Lisa Fraga', 'Robert Abdullah', 'Carole Robertson',
       'James Mosely', 'Alease Puckett', 'Michael Phillips', 'Sarah Nash',
       'Alyssa Mckinney', 'Christopher Brandt', 'Jennifer Peck',
       'Samuel Campbell', 'Mark Brown', 'Mary Brooks', 'Yvonne Jones',
       'Victor Groves'], dtype=object)

In [23]:
#total count of unique values
df['sales_rep'].nunique()

99

In [24]:
#total count of unique values
len(df['sales_rep'].unique())

99

## Basic Operations with Separate Data

In [3]:
df1=pd.DataFrame({"A": np.random.randint(low=0, high=100, size=100), "B": range(100,200)})

In [4]:
df1

     A    B
0    4  100
1    8  101
2   29  102
3   63  103
4   69  104
..  ..  ...
95  73  195
96  75  196
97  97  197
98   1  198
99  28  199

[100 rows x 2 columns]

In [5]:
df1['B']

0     100
1     101
2     102
3     103
4     104
     ...
95    195
96    196
97    197
98    198
99    199
Name: B, Length: 100, dtype: int64

In [6]:
#same as above, wont work if spaces in column name
df1.B

0     100
1     101
2     102
3     103
4     104
     ...
95    195
96    196
97    197
98    198
99    199
Name: B, Length: 100, dtype: int64

In [31]:
#Sorting

df1=df1.sort_values(by=['A'])
df1

     A    B
43   0  143
11   0  111
69   0  169
87   0  187
20   1  120
..  ..  ...
54  96  154
47  96  147
2   97  102
81  98  181
51  99  151

[100 rows x 2 columns]

In [32]:
df1=df1.sort_values(by=['A','B'])
df1

     A    B
11   0  111
43   0  143
69   0  169
87   0  187
20   1  120
..  ..  ...
47  96  147
54  96  154
2   97  102
81  98  181
51  99  151

[100 rows x 2 columns]

In [8]:
df1=pd.DataFrame({'A':[0,1,0,1,0,0,0], 'B':[1,1,1,1,0,0,0]})
df1

   A  B
0  0  1
1  1  1
2  0  1
3  1  1
4  0  0
5  0  0
6  0  0

In [36]:
#cumulative sum of A in C
df1['C']=df1['A'].cumsum()
df1

   A  B  C
0  0  1  0
1  1  1  1
2  0  1  1
3  1  1  2
4  0  0  2
5  0  0  2
6  0  0  2

In [40]:
#rearranging columns
df1=df1[['A','C','B']]
df1

   A  C  B
0  0  0  1
1  1  1  1
2  0  1  1
3  1  2  1
4  0  2  0
5  0  2  0
6  0  2  0

In [41]:
#sorting columns
df1.sort_index(axis=1)

   A  B  C
0  0  1  0
1  1  1  1
2  0  1  1
3  1  1  2
4  0  0  2
5  0  0  2
6  0  0  2

In [43]:
df1=pd.DataFrame({'A':[0,1,0,1,0,0,0], 'B':[1.1,1.2,1,1,0,0,0], 'C':['a','b','c','d','e','f','g']})
df1

   A    B  C
0  0  1.1  a
1  1  1.2  b
2  0  1.0  c
3  1  1.0  d
4  0  0.0  e
5  0  0.0  f
6  0  0.0  g

In [9]:
df1['A']==1

0    False
1     True
2    False
3     True
4    False
5    False
6    False
Name: A, dtype: bool

In [44]:
#Slicing

df1[df1['A']==1]

   A    B  C
1  1  1.2  b
3  1  1.0  d

In [46]:
df1[(df1['A']==1) & (df1['B']==1)]

   A    B  C
3  1  1.0  d

In [47]:
(df1['A']==1) & (df1['B']==1)

0    False
1    False
2    False
3     True
4    False
5    False
6    False
dtype: bool

In [50]:
df1[(df1['A']==1) | (df1['B']==1)]

   A    B  C
1  1  1.2  b
2  0  1.0  c
3  1  1.0  d

In [53]:
df1

   A    B  C
0  0  1.1  a
1  1  1.2  b
2  0  1.0  c
3  1  1.0  d
4  0  0.0  e
5  0  0.0  f
6  0  0.0  g

In [54]:
#showing rows when C column has a,b,c values
df1[df1['C'].isin(['a','b','c'])]

   A    B  C
0  0  1.1  a
1  1  1.2  b
2  0  1.0  c

In [55]:
df1[~df1['C'].isin(['a','b','c'])]

   A    B  C
3  1  1.0  d
4  0  0.0  e
5  0  0.0  f
6  0  0.0  g

In [59]:
#Astype

df2=pd.DataFrame({'A':[0,1,0,1,0,0,0], 'B':[1.1,1.2,1,1,0,0,0], 'C':['a','b','c','d','e','f','g']})
df2

   A    B  C
0  0  1.1  a
1  1  1.2  b
2  0  1.0  c
3  1  1.0  d
4  0  0.0  e
5  0  0.0  f
6  0  0.0  g

In [60]:
df2.dtypes

A      int64
B    float64
C     object
dtype: object

In [62]:
df2['B']=df2['B'].astype(int)

In [63]:
df2.dtypes

A     int64
B     int32
C    object
dtype: object

In [64]:
df2

   A  B  C
0  0  1  a
1  1  1  b
2  0  1  c
3  1  1  d
4  0  0  e
5  0  0  f
6  0  0  g

In [65]:
#Crosstab

df1=pd.DataFrame({'A':[0,1,0,1,0,0,0], 'B':[1,1,1,1,0,0,0]})
df1

   A  B
0  0  1
1  1  1
2  0  1
3  1  1
4  0  0
5  0  0
6  0  0

In [67]:
#first one 3 shows A=0 and B=0 is present 3 times in DF
pd.crosstab(index=df1['A'], columns=df1['B'])

B  0  1
A
0  3  2
1  0  2

In [70]:
#also summing values
pd.crosstab(index=df1['A'], columns=df1['B'],margins=True,margins_name="Total")

B      0  1  Total
A
0      3  2      5
1      0  2      2
Total  3  4      7

In [72]:
#normalize gives just proportion values
pd.crosstab(index=df1['A'], columns=df1['B'],margins=True,margins_name="Total",normalize=True)

B             0         1     Total
A
0      0.428571  0.285714  0.714286
1      0.000000  0.285714  0.285714
Total  0.428571  0.571429  1.000000

In [74]:
df1=pd.DataFrame({'age':np.random.randint(low=18, high=74, size=2000)})
df1.head()

   age
0   59
1   59
2   54
3   41
4   62

In [76]:
#Cut

#bins is basically range
#example - young is from 0 to 25, middle is 35 to 60
#right means right range values inclusive or not - if true then inclusive
#include lowest - if the first interval should be left-inclusive or not

bins=[0,25,35,60,120]
labels=['young','lower middle','middle','senior']
df1['age_group']=pd.cut(df1['age'],bins=bins,labels=labels, include_lowest=True, right=False)
df1.head()

   age age_group
0   59    middle
1   59    middle
2   54    middle
3   41    middle
4   62    senior

In [77]:
#Duplicate Removal

df1=pd.DataFrame({'A':[0,1,0,1,0,0,0], 'B':[1,1,1,1,0,0,0]})
df1

   A  B
0  0  1
1  1  1
2  0  1
3  1  1
4  0  0
5  0  0
6  0  0

In [78]:
#remove entirely duplicate rows
df1.drop_duplicates()

   A  B
0  0  1
1  1  1
4  0  0

In [80]:
#reverse of last code, it will keep last unique values
df1.drop_duplicates(keep='last')

   A  B
2  0  1
3  1  1
6  0  0

In [79]:
#keep rows having unique values of A and drop rest
df1.drop_duplicates(subset=['A'])

   A  B
0  0  1
1  1  1

In [13]:
#Concat

df1=pd.DataFrame([['a',1],['b',2]], columns = ['letter','number'])
df1

  letter  number
0      a       1
1      b       2

In [82]:
df2=pd.DataFrame([['c',3],['d',4]], columns = ['letter','number'])
df2

  letter  number
0      c       3
1      d       4

In [84]:
pd.concat([df1,df2])

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [85]:
#index auto updated
pd.concat([df1,df2], ignore_index=True)

  letter  number
0      a       1
1      b       2
2      c       3
3      d       4

In [10]:
df3=pd.DataFrame([['c',3,'cat'],['d',4,'dog']], columns = ['letter','number','animal'])

In [11]:
df3

  letter  number animal
0      c       3    cat
1      d       4    dog

In [14]:
pd.concat([df1,df3], ignore_index=True, sort=False)

  letter  number animal
0      a       1    NaN
1      b       2    NaN
2      c       3    cat
3      d       4    dog

In [15]:
df4=pd.DataFrame([['bird','polly'],['monkey','george']], columns = ['animal','name'])

In [16]:
pd.concat([df1,df4], axis=1)

  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

In [22]:
#Merge

#use merge mainly when doing like joins
left=pd.DataFrame({'key':['K0','K1','K2','K3'],'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3']})
right=pd.DataFrame({'key':['K0','K1','K2','K3'],'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']})

In [23]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [24]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [25]:
result=pd.merge(left,right,on='key')
result

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [30]:
left=pd.DataFrame({'key1':['K0','K1','K2','K3'],'key2':['K0','K1','K0','K1'],'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3']})
right=pd.DataFrame({'key1':['K0','K1','K2','K3'],'key2':['K0','K0','K0','K0'],'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']})

In [31]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K1   K1  A1  B1
2   K2   K0  A2  B2
3   K3   K1  A3  B3

In [32]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K2   K0  C2  D2
3   K3   K0  C3  D3

In [33]:
#like inner join
#key1,key2 should match in both tables
result=pd.merge(left,right,on=['key1','key2'])
result

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K2   K0  A2  B2  C2  D2

In [37]:
#inner join
result=pd.merge(left,right,how='inner',on=['key1','key2'])
result

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K2   K0  A2  B2  C2  D2

In [34]:
#left join
result=pd.merge(left,right,how='left',on=['key1','key2'])
result

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K1   K1  A1  B1  NaN  NaN
2   K2   K0  A2  B2   C2   D2
3   K3   K1  A3  B3  NaN  NaN

In [35]:
#right join
result=pd.merge(left,right,how='right',on=['key1','key2'])
result

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K2   K0   A2   B2  C2  D2
2   K1   K0  NaN  NaN  C1  D1
3   K3   K0  NaN  NaN  C3  D3

In [36]:
#outer join
result=pd.merge(left,right,how='outer',on=['key1','key2'])
result

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K1   K1   A1   B1  NaN  NaN
2   K2   K0   A2   B2   C2   D2
3   K3   K1   A3   B3  NaN  NaN
4   K1   K0  NaN  NaN   C1   D1
5   K3   K0  NaN  NaN   C3   D3

In [2]:
# DateTime

df=pd.DataFrame({"Date":["2019-1-1","2019-2-1","2019-3-1"],"Sales":["100","200","300"]})
df

       Date Sales
0  2019-1-1   100
1  2019-2-1   200
2  2019-3-1   300

In [6]:
df.dtypes

Date     object
Sales    object
dtype: object

In [7]:
df['Date']=pd.to_datetime(df['Date'],format="%Y-%m-%d")

In [9]:
df.dtypes

Date     datetime64[ns]
Sales            object
dtype: object

In [10]:
df.Date[0]

Timestamp('2019-01-01 00:00:00')

In [11]:
df.Date[0].day

1

In [12]:
df.Date[0].day_name()

'Tuesday'

In [13]:
df.Date[0].weekday()

1

In [14]:
df['Date']

0   2019-01-01
1   2019-02-01
2   2019-03-01
Name: Date, dtype: datetime64[ns]

In [16]:
#finding weekday for each date in dataframe

df['weekday'] = df['Date'].apply(lambda x: x.weekday())
df.head()

        Date Sales  weekday
0 2019-01-01   100        1
1 2019-02-01   200        4
2 2019-03-01   300        4